home/valentino/modules/editors/emacs/config/setup.org
:PROPERTIES:
:lisp_path: ~/nix-config/home/valentino/modules/editors/emacs/config/lisp/
:END:
#+AUTHOR: Valentino Bocchetti
#+TITLE: Emacs configuration
#+DESCRIPTION: My personal config using setup.el
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: overview
* Preface
#+begin_quote
One day we won't hate one another, no young boy will march to war and I will clean up my Emacs config. But that day isn't today.

Emacs is /blursed/ due to it's global state. Since Emacs packages are just a way to pin targeted ~eval~'s, and everything can touch everything, the world is both within reach, and out of grasp. You can do much if you cut at the joints, and you may seek understanding by inspecting the editor to see what is going on underneath. As with most tools, you get back what you put into it. This repository reflects a playground of ideas concerning prose, code, aesthetics, and time management -- an ever evolving mess.
#+end_quote

#+begin_src text
  ,           ,
 /             \
((__-^^-,-^^-__))
 `-_---' `---_-'
  `--|o` 'o|--'
     \  `  /
      ): :(
      :o_o:
       "-"
#+end_src

This is an Emacs configuration file written in [[http://orgmode.org][Org mode]]. It is an attempt
to keep my =~/config/emacs/= tidy, but still be able to keep it all in one
file. I aim to briefly explain all my configurations as I go along!

I would not recommend using this configuration /as-is/, because it
probably contains a lot you don't really need. I do, however, hope people
find some golden nuggets that they can smuggle into their own configs.
** Notes on this document
Every file is commented in a decent way, but I'm not very verbose. Sometimes I describe every single things written (in a decent way, I guess), other times, I'm awful.
Anyway, this document is not intended as a way to show my =elisp-fu= or something like that. When you read this, imagine a diary, a tale of my [mis]adventures 🤣.
** Before =gui= - =early-init.el=
Is good practice to define an =early-init.el= file: this kind of approach provides better loading for essential stuff.
- There are some tweaks taken from [[https://github.com/doomemacs/doomemacs][DOOM Emacs]], [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][David Wilson]], [[https://protesilaos.com/emacs/dotemacs][Protesilaos Stavrou]]... (I'll put some credits at the end of this document, along with useful resources)
- The package manager, [[https://github.com/radian-software/straight.el][straight.el]], provides reproducibility (like Nix and Guix) with recipes, allows the editing of packages and manual version control operations on repos. [[https://github.com/radian-software/straight.el#advantages-of-straightel-5][Here]] the list of advantages.
#+include: "early-init.el" src emacs-lisp :tangle no
** Mandatory settings for the "init"

Note that =init.el= is mandatory, however I'm tangling it from this =.org= file (=Emacs.org=).

I have decided to tangle this document in =init.el= because I want to keep a few things in the main directory, while populating submodules to manage all of this.

#+begin_src emacs-lisp
;;; init.el ---  Emacs configuration -*- coding: utf-8 ; lexical-binding: t -*-

;; Author: luftmensch-luftmensch

;; This file IS NOT intended to be edited!

;;; Commentary:
;;                    ____,
;;                   /.---|
;;                   `    |     ___
;;                       (=\.  /-. \
;;                        |\/\_|"|  |
;;                        |_\ |;-|  ;
;;                        | / \| |_/ \
;;                        | )/\/      \
;;                        | ( '|  \   |
;;                        |    \_ /   \
;;                        |    /  \_.--\
;;                        \    |    (|\`
;;                         |   |     \
;;                         |   |      '.
;;                         |  /         \
;;                         \  \.__.__.-._)
;;
;;
;; Well, hello there! How are you doing wanderer? Looking for some
;; lisp goodness?  You might find it here, you might not.  If you do
;; find what you are looking for here, feel free take them with you,
;; give them a new life, a new filesystem, a new home.  All I ask of
;; you is to treat them with love and care.  They have always been
;; with me, playing along with my musing, catching little typos and
;; finding little bugs.  They stuck strong to my side even when the
;; Rust borrow checker came for me.  I'm not gonna lie, there has been
;; many a times where I have doubted my skills, but they have always
;; believed in me.
;;
;; If these parenthesis could talk, they would have a lot of stories
;; to tell.  Some good, some bad, some really ugly.  But at the end of
;; the day, I'm sure they are all happy to be where they are.
;;
;; If they give you any trouble, my GitHub issues is always open
;; unlike the doors of heaven.  They probably won't, these are the
;; good ones, but God sometimes have different plans, and everyone
;; gets hit with hard times.
;;
;; For any additional documentation and for editing this file, see leaf.org
;;
;; Good luck!

;; -------------------------------------------------------------------------------- ;;
;;   This file was auto-tangled from an orgmode file. (C)  luftmensch-luftmensch    ;;
;; -------------------------------------------------------------------------------- ;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;; Code:

;; Do not pollute `init.el` with user customizations, use instead the proper `custom.el`
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file) (load custom-file 'noerror 'nomessage))
;; A sane default for bookmarks (synched between devices)
;; (setq bookmark-default-file "~/config/emacs/bookmarks")
(setq bookmark-default-file (locate-user-emacs-file "bookmarks")
      ;; The current config is a symlink handled by nix
      vc-follow-symlinks t)

;; Disable damn sleep!
;; Yep, it's mandatory, that's the worst keybind ever, and should be remapped
(global-unset-key (kbd "C-z"))

;; Functions to determine if we are using a Nix installation of Emacs, or not, then we set our configuration path.
(defun vb/using-nix-p ()
  "Verifies if the running Emacs executable is under the `/nix/store/' path."
  (unless (or (equal system-type 'ms-dos)
              (equal system-type 'windows-nt))
    ;; Since there is no windows implementation of nix
    (string-prefix-p "/nix/store/"
                     (file-truename
                      (executable-find
                       (car command-line-args))))))
(defvar vb/config-path
  (let ((real-path (expand-file-name
                    "config/emacs/"
                    (getenv "HOME"))))
    (if (and (vb/using-nix-p)
             (file-exists-p real-path))
        (expand-file-name real-path)
      (expand-file-name user-emacs-directory))))
#+end_src
* Core settings
** Package boostrap w/ [[https://git.sr.ht/~pkal/setup][setup.el]]
We are requiring =init-setup=, where configuration tools based on macros (e.g. =use-package=, =leaf.el=, =setup.el=) are initialized.

I'm using [[https://git.sr.ht/~pkal/setup][setup.el]] right now.
Compared to =use-package=, =setup.el= is less declarative: you have more control, I would say that it's similar to vanilla Emacs configuration, but less verbose and with easy definition of new macros.

I also install [[https://github.com/radian-software/blackout][blackout.el]] (and define a macro with =setup.el=) here, to manage modes displayed in the mode-line.

#+begin_src emacs-lisp
;; Require package management file
(require 'init-setup)
#+end_src

#+include: "lisp/init-setup.el" src emacs-lisp :tangle no
** Performance enhancement
[[https://github.com/emacsmirror/gcmh][GCMH]] allows the auto-regulation of garbage collector based on idle timers.

During normal use a high GC threshold is set; when idling GC is triggered and a low threshold is set. Right now I'm good with 16MB for high threshold.
Other tweaks in this section have been stolen from DOOM and other configurations around.
#+begin_src emacs-lisp
(require 'init-performance)
#+end_src

#+include: "lisp/init-performance.el" src emacs-lisp :tangle no
** Keyboard support
Sometimes we forget shortcuts as we type them, [[https://github.com/justbur/emacs-which-key][which-key]] is a minor mode for Emacs that displays the key bindings following your currently entered incomplete command in a popup.

#+begin_src emacs-lisp
(require 'init-help)
#+end_src

#+include: "lisp/init-help.el" src emacs-lisp :tangle no
** Appearance
In this section are contained line-numbers settings, modeline related configuration, minor tweaks for icons (needed also for dashboard) and colors.
*** Fonts
Readability is important, another package from Protesilaos, much more!
Currently using [[https://picaq.github.io/sarasa/][Sarasa Gothic Mono]] as font, I love it, also for variable-pitch face.
#+begin_src emacs-lisp
(require 'init-fonts)
#+end_src

#+include: "lisp/init-fonts.el" src emacs-lisp :tangle normal
*** Theming
I'm currently using [[https://protesilaos.com/emacs/modus-themes][Modus Themes]], with [[https://github.com/guidoschmidt/circadian.el][Circadian]] to set light/dark version, based on time. It's possible to switch themes on sunrise and sunset. Protesilaos made a great work, and these themes are, indeed, built into Emacs (but I always get the packaged version :D)

#+begin_src emacs-lisp
(require 'init-themes)
#+end_src

#+include: "lisp/init-themes.el" src emacs-lisp :tangle no
*** Minor UI settings
Nothing special, some minor customizations
#+begin_src emacs-lisp
(require 'init-appearance)
#+end_src

#+include: "lisp/init-appearance.el" src emacs-lisp :tangle no
*** Modeline
Just modeline customization. (Special thanks to [[https://amitp.blogspot.com/2011/08/emacs-custom-mode-line.html][amitp]] & [[https://gist.github.com/fhdhsni/990cba7794b4b6918afea94af0b30d66][fhdhsni]])
#+begin_src emacs-lisp
(require 'init-modeline)
#+end_src

#+include: "lisp/init-modeline.el" src emacs-lisp :tangle no
* Interface interaction
This section contains my file and buffer related configurations. Nothing special.
** Keybindings on steroids w/ [[https://github.com/noctuid/general.el][general.el]]
#+begin_src emacs-lisp
(require 'init-keybindings)
#+end_src

#+include: "lisp/init-keybindings.el" src emacs-lisp :tangle no
** Emacs goes [[https://github.com/emacs-evil/evil][evil]]
#+begin_src emacs-lisp
(require 'init-evil)
#+end_src

#+include: "lisp/init-evil.el" src emacs-lisp :tangle no
** Editing enhancement
Tweaks present here:
- Scroll (and smooth scroll for Emacs >= 29) and horizontal scroll with mouse;
- Truncate lines hook for =prog-mode=;
- Electric-pair mode and show-paren;
- Autorevert files after changes;
- Rainbow-mode;
- Delete-selection mode to overwrite selected regions;
- Drag-stuff to...drag stuff around;
- etc.
#+begin_src emacs-lisp
(require 'init-editing)
#+end_src

#+include: "lisp/init-editing.el" src emacs-lisp :tangle no
** Windows navigation
Moving around windows can be painful, but some built-in functions save our a*s.
#+begin_src emacs-lisp
(require 'init-windows)
#+end_src

#+include: "lisp/init-windows.el" src emacs-lisp :tangle no
** Buffer management
Sometimes buffers are too much, and I think that the classic buffer-menu is meh.
With =ibuffer= I can group buffers in ~Gnus~ style, customize actions remembering ~Dired~, and so on.

#+begin_src emacs-lisp
(require 'init-buffers)
#+end_src

#+include: "lisp/init-buffers.el" src emacs-lisp :tangle no
