home/valentino/modules/editors/emacs/config/setup.org
** Dired
Dired is a built-in file manager for Emacs that does some pretty amazing things. I currently use it as my primary file manager.

There's also a package named [[https://github.com/alexluigit/dirvish][dirvish]], a true work of art. It is:
+ Fast;
+ Unobtrusive;
+ Elegant;

It is all this, and it still is dired. It is exactly what a file manager in Emacs should be. I thought ranger was still lightyears ahead of dired, but dirvish has proved me wrong.

Dirvish solves these issues for me:
- It provides file copying/movement that is *both* multi-stage and asynchronous (unlike existing packages).  This is a game changer.
- Image preview is actually fast and usable.  I had stopped using all packages for image preview before because they didn't work well.  With dirvish, once an image is cached, it's as fast as any preview method that ranger has, and there is no flicker (unlike some ranger preview methods).  This is also a game changer.
- File preview in general works flawlessly out of the box and is customizable
- Dirvish is gorgeous, more so than ranger, but without sacrificing speed
  - The mode line is simple, customizable, and easy on the eyes
  - Icon display is fast/lazy unlike dired-all-the-icons, which is unusably slow
  - It can also replace the functionality of dired-k (very slow) and dired-git-info
  - I only had to customize one face to get it to look great with my theme
- It provides a 3-pane layout that just works (parent directory, current directory, preview).  I never used ranger.el's 3-pane layout, but I will use dirvish's.
- It provides various other helpful commands/features like bookmarks
- It is a minimal layer on top of dired and requires minimal configuration.  I had to make many more keybindings for ranger.el since it creates alternatives for a lot of existing dired commands, and I had a bunch of ugly configuration because it was comparably invasive (as both a dired user and as an evil user).

Dirvish replaces
- Replaces ranger.el (though not a ranger clone)
- Replaces dired-async, tmtxt-dired-async, dired-ranger, etc.
- Replaces dired-all-the-icons with a much more performant implementation
- Can replace dired-k, dired-git-info, and diff-hl-dired-mode (though my experience with diff-hl was much better than dired-k)
#+begin_src emacs-lisp
(require 'init-dired)
#+end_src

#+include: "lisp/init-dired.el" src emacs-lisp :tangle no
* Selection and search
This is one of my favourite parts. I think that fast selection, completing and search are a must, always, everywhere.

** Monster trio of completion
As Completion UI [[https://github.com/minad/vertico][Vertico]] is my preferred choice, it's lightweight and fast, and relies on Emacs internals. [[https://github.com/minad/marginalia/][Marginalia]] for rich annotations provides a summary for candidates.
Completion can be better with an [[https://github.com/oantolin/orderless][Orderless]] (similar to FZF, if you know). Orderless is also customizable for matching style.
#+begin_src emacs-lisp
(require 'init-complete)
#+end_src

#+include: "lisp/init-complete.el" src emacs-lisp :tangle no
** Embark
[[https://github.com/oantolin/embark/][Embark]] provides contextual menu offering actions for a target determined in the context, exactly like a contextual menu.
#+begin_src emacs-lisp
(require 'init-embark)
#+end_src

#+include: "lisp/init-embark.el" src emacs-lisp :tangle no
** Consult
[[https://github.com/minad/consult][Consult]] provides practical commands based on the Emacs completion function completing-read.

Consult offers, for example:
- Buffer switching command =consult-buffer= to switch between buffers and recently opened files.
- Multiple asynchronous search commands:
  - =consult-grep=
  - =consult-ripgrep=
  - =consult-line=, which resembles [[https://github.com/abo-abo/swiper][Swiper]]
#+begin_src emacs-lisp
(require 'init-consult)
#+end_src

#+include: "lisp/init-consult.el" src emacs-lisp :tangle no
** Completion at point
I'm using [[https://github.com/minad/corfu][Corfu]] with [[https://github.com/minad/cape][Cape]] right now, while [[https://github.com/company-mode/company-mode][Company]] stuff is here due to other modes completion backends which relies on it. I prefer Corfu especially because it uses Emacs completion facilities, and child frames instead of overlays.

Completions are provided by commands which provide completion, or by Capfs (=completion-at-point-functions=). Many major modes implement a Capf, also LSP clients which talk to the LSP server to retrieve completion.

Cape provides extensions and backends. A great thing of Cape is the =cape-company-to-capf= adapter for Company backends, and it is very easy to use!

#+begin_src emacs-lisp
(require 'init-complete-in-buffer)
#+end_src

#+include: "lisp/init-complete-in-buffer.el" src emacs-lisp :tangle no
* Org Mode
#+begin_quote
Org mode is for keeping notes, maintaining TODO lists, planning projects, and
authoring documents with a fast and effective plain-text system.
--- Carsten Dominik
#+end_quote

Org mode is the killer feature of Emacs. Markup language, agenda, brain, templates...you can do /literally/ (xD) everything.
** Essential configuration
I absolutely need focus when I'm editing my documents in the dark, so I want my buffer centered and lines untruncated.
Indentation is defined as a function for basic org-mode setup.
[[https://github.com/minad/org-modern][Org Modern]] replaces markup syntax with nice headings, TODOs etc.
#+begin_src emacs-lisp
(require 'init-org)
#+end_src

#+include: "lisp/init-org.el" src emacs-lisp :tangle no
** Babel and Tempo
To execute or export code in =org-mode= code blocks, we need to set up =org-babel-load-languages= for each language. [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.
To add more =src= block templates, just copy one of the lines and change the two strings at the end, the first to be the template name and the second to contain the name of the language ([[https://orgmode.org/worg/org-contrib/babel/languages.html][listed here]]).

There's also a snippet that adds a hook to =org-mode= buffers so that ~archer-org-babel-tangle-config~ gets executed each time such a buffer gets saved. This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files. This function is inspired by David Wilson of System Crafters.

#+begin_src emacs-lisp
(require 'init-org-languages)
#+end_src

#+include: "lisp/init-org-languages.el" src emacs-lisp :tangle no
** Exporting
#+begin_src emacs-lisp
(require 'init-org-export)
#+end_src

Org is surely nice, but what about export?
Wonderful, but it needs some tweaks, and not only for presentations.

The first section of this file is regards good LaTeX export through =ox-latex=.
The best way to set export options is [[https://jakebox.github.io/youtube/org_latex_video.html][the following]].

Structure every file like this:

#+begin_src org
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [letterpaper]
#+OPTIONS: toc:nil
#+SETUPFILE: ~/your/path/to/setup/file.org
#+end_src

Reveal.js presentations are exported through =ox-reveal=, which is very simple to configure.

The hidden gem is =ox-hugo=, you can manage your website content from Emacs, that's cool. You can also manage your contents with a single file, multiple files, or both ways!

#+include: "lisp/init-org-export.el" src emacs-lisp :tangle no

** Useful links
+ [[https://www.labri.fr/perso/nrougier/GTD/index.html][Get Things Done with Emacs]]
* Development
All my packages needed to develop in a decent way. Bye IDEs.
** Projects management and Git
[[https://github.com/bbatsov/projectile][Projectile]] provides easy project management and navigation.
Common Git operations are easy to execute quickly using _Magit_'s command panel system.
*NOTE*: Make sure to configure a GitHub token before using this package!
- [[https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started][Getting started with Magit]]
- [[https://magit.vc/manual/forge/Token-Creation.html#Token-Creation][Token Creation]]

#+begin_src emacs-lisp
(require 'init-projects)
#+end_src

#+include: "lisp/init-projects.el" src emacs-lisp :tangle no
** Code style
[[https://github.com/lassik/emacs-format-all-the-code][Format-all-the-code]] lets you auto-format source code in many languages. It is very nice, you need only the formatters installed on your system.

[[https://github.com/glasserc/ethan-wspace][Ethan-wspace]] is a nice package to avoid useless/horrible extra whitespaces.

[[https://github.com/Fanael/rainbow-delimiters][Rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth. This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

The rest of =init-code-style.el= regards tab settings.

#+begin_src emacs-lisp
(require 'init-code-style)
#+end_src

#+include: "lisp/init-code-style.el" src emacs-lisp :tangle no
** Syntax checking
Lately I've been trying =Flymake=, built-in into Emacs. [[https://www.flycheck.org/][Flycheck]] has many checkers though, so here we go with [[https://github.com/purcell/flymake-flycheck]["how to use Flycheck chekers in Flymake"]]

#+begin_src emacs-lisp
(require 'init-spell-and-check)
#+end_src

#+include: "lisp/init-spell-and-check.el" src emacs-lisp :tangle no

** LSP
[[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]] support with multiples languages support for Emacs.
There are two ways to use LSP with Emacs: [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]] and [[https://github.com/joaotavora/eglot][Eglot]] (built into Emacs 29). I prefer the latter for the following reason, given by the author of =Eglot=:
#+begin_quote
Eglot is considerably less code and hassle than lsp-mode.el. In most cases, there's nothing to configure. It's a minimalist approach focused on user experience and performance.
#+end_quote
To avoid copy-pasting, here the [[https://github.com/joaotavora/eglot#historical-differences-to-lsp-modeel][full comparision]].

#+begin_src emacs-lisp
(require 'init-lsp)
#+end_src

#+include: "lisp/init-lsp.el" src emacs-lisp :tangle no
** Snippets
#+begin_src emacs-lisp
;; (require 'init-snippets)
#+end_src

#+include: "lisp/init-snippets.el" src emacs-lisp :tangle no
** Extra modes
#+begin_src emacs-lisp
(require 'init-extra-modes)
#+end_src

#+include: "lisp/init-extra-modes.el" src emacs-lisp :tangle no

* Frontend for other uses
Emacs can be a frontend for almost everything.
** Mails
I've used =mu4e= (mu-for-emacs) for almost a year. It is an e-mail client for GNU Emacs version 24.4 or higher, built on top of the [[https://github.com/djcb/mu][mu]] e-mail search engine. =mu4e= is optimized for quickly processing large amounts of e-mail.
However, I've always struggled with it, and I recently tried [[https://notmuchmail.org/][notmuch]]. Oh boy, I wish I had done it sooner!
It is a very fast tag-based email indexer and system to use with multiple clients, Emacs, Neomutt, and so on.

#+begin_quote
"Not much mail" is what Notmuch thinks about your email collection. Even if you receive 12000 messages per month or have on the order of millions of messages that you've been saving for decades. Regardless, Notmuch will be able to quickly search all of it. It's just plain not much mail.
#+end_quote

#+begin_quote
"Not much mail" is also what you should have in your inbox at any time. Notmuch gives you what you need, (tags and fast search), so that you can keep your inbox tamed and focus on what really matters in your life, (which is surely not email).
#+end_quote

#+begin_src emacs-lisp
(require 'init-mail)
#+end_src

#+include: "lisp/init-mail.el" src emacs-lisp :tangle no

** Writing

TeX, with AUCTeX!

#+begin_src emacs-lisp
;; (require 'init-tex)
#+end_src

#+include: "lisp/init-tex.el" src emacs-lisp :tangle no
** Reading
I don't like DocView because the rendering is given by images in tmp storage, zoom is "bad" (for me, of course), rendering can be slow, with especially PDFs big.
My choice is [[https://github.com/vedang/pdf-tools][pdf-tools]], that renders on demand pages, has good quality, and is very comfortable.

#+begin_src emacs-lisp
(require 'init-reading)
#+end_src

#+include: "lisp/init-reading.el" src emacs-lisp :tangle no
** Terminal
Vterm is an actual terminal emulator and my preferred method for executing shell command in Emacs. The main downsides it has for me compared to eshell and shell currently:

- There are some things that need to be polished (e.g. it changes cursor shape which is confusing when using different cursors for evil: #342)
- Every character is sent to the terminal immediately, so evil line-editing is not yet possible (minor since Emacs line-editing keybindings are more efficient, and the current behavior works with autosuggestions; sending the line only on enter would break autosuggestions)
- It does not currently integrate with completing-read frontends for completion

It might be cool to eventually replace a dedicated terminal emulator with vterm. Scrollback search, navigation, and copying are definitely better in Emacs than in any terminal or multiplexer.

Thanks to this [[https://www.reddit.com/r/emacs/comments/u5rx6z/open_vterm_in_resized_horizontal_split/][thread]] vterm-toggle is no more necessary!

#+begin_src emacs-lisp
(require 'init-shell)
#+end_src

#+include: "lisp/init-shell.el" src emacs-lisp :tangle no
** Telegram
Beautiful client, maybe the best telegram client around. A PITA, sometimes, due to tdlib compatibility.

#+begin_src emacs-lisp
(require 'init-telega)
#+end_src

#+include: "lisp/init-telega.el" src emacs-lisp :tangle no
*** Useful commands
+ ~c~ telega-msg-copy-text
+ ~l~ telega-msg-copy-link
+ ~^~ telega-msg-pin-toggle
+ ~M-g ^~ telega-chatbuf-goto-pinned-message
+ telega-msg-redisplay
** Media
Manage your media from Emacs? Possible!
#+begin_src emacs-lisp
;; (require 'init-media)
#+end_src

#+include: "lisp/init-media.el" src emacs-lisp :tangle no
** Daemons control
Nice mode to control your system (and user) services without leaving Emacs.

#+begin_src emacs-lisp
(setup (:pkg daemons))
#+end_src
* Games
Did you know that emacs can play games (sort of) too?
#+begin_src emacs-lisp
(require 'init-games)
#+end_src

#+include: "lisp/init-games.el" src emacs-lisp :tangle no
* End
#+begin_src emacs-lisp
;;; init.el ends here
#+end_src

This is the end of my =init.el=, and of my configuration.
* Useful things
