home/valentino/modules/editors/emacs/config/init.el

(require 'init-dired)

(require 'init-complete)

(require 'init-embark)

(require 'init-consult)

(require 'init-complete-in-buffer)

(require 'init-org)

(require 'init-org-languages)

(require 'init-org-export)

(require 'init-projects)

(require 'init-code-style)

(require 'init-spell-and-check)

(require 'init-lsp)

;; (require 'init-snippets)

(require 'init-extra-modes)

(require 'init-mail)

;;(require 'init-tex)

(require 'init-reading)

(require 'init-shell)

(require 'init-telega)
(require 'init-games)

;; (require 'init-media)

;; Nice mode to control your system (and user) services without leaving Emacs.
(setup (:pkg daemons))


;;; init.el ends here
